{
        "id": "satellite/1470/1470.jpg",
        "image": "train/satellite/1470/1470.jpg",
        "caption": {
            "roof": "The central building features a complex, multi-section roof design with irregular shapes, predominantly using dark gray roofing material. Two visually striking red dome-shaped turrets are located symmetrically at the front corners of the roof, adding a distinctive architectural feature. Adjacent roof sections consist of both steeply pitched and flat surfaces. A notable green space sits atop a rectangular roof of a nearby structure to the rear. Other nearby buildings have rectangular roofs with similar flat designs, predominantly gray and light materials. The immediate surroundings include roads intersecting near the building, with marked bike lanes and pedestrian crossings, along with small patches of trees and grass. The area primarily comprises urban architecture interspersed with greenery.",
            "around": "The central building, distinguished by its pointed roof with a black or dark gray color and circular red domes, occupies a prominent position in the image. Its roof features a complex design with multiple sharp ridges converging around the building's peaks. The overall shape of the roof is irregular but visually aligns with an \"L-shape,\" and the black roofing material contrasts sharply with the two red cylindrical dome structures located symmetrically at the front corners. It is likely composed of metal or slate materials, contributing to its smooth and reflective surfaces. The building’s structure also exhibits smaller rectangular skylights distributed along its roof edges. To the left of the central building is a construction with a predominantly flat roof covered by a green patch, possibly a vegetation feature or rooftop garden, bordered by light gray rectangular outlines. The green roof contrasts with the building's overall rigid rectangular form. Adjoining it is another flat-roofed structure in lighter gray tones, similarly rectangular in layout and simple in design featuring no prominent roof features. Materials suggest a combination of concrete panels and metal for these nearby structures. In front of the central building is a road intersection in an angled layout, forming a three-way junction.In front of the central building is a road intersection in an angled layout, forming a three-way junction.  Traffic markings, including arrows and painted lanes, are noticeable in white on the gray asphalt surface. Surrounding these roads, green-painted bike lanes are situated on the outer edges of the asphalt, contrasting with the neutral tones of the roadway. These lanes include directional arrows and narrower lane markers. On the left and back sides of the intersection, several small public spaces with light gray stone paving and beige walkways are visible. Adjacent to the central building, vegetation is concentrated in rectangular patches with tree clusters positioned along the sidewalks, creating a planned landscape. Grass fields appear in geometric areas combined with a scattered array of trees. No presence of water features or special objects such as fountains is evident. Toward the bottom right and front-right, other rectangular buildings with predominantly flat asphalt or shingled roofs are evident. Their configurations include lighter earth-toned materials and simpler designs. Overall, the structural layout centers around the central building, with secondary structures and roads radiating outward in organized directions."
        }
    },
{
        "id": "drone/1470/image-30.jpeg",
        "image": "train/drone/1470/image-30.jpeg",
        "caption": {
            "roof": "The central building in the image is a multi-story structure with a dark gray, pitched roof featuring distinctive turrets and a conical tower section. The roof is symmetrical and primarily covered in slate or shingle material, with some sections showing lighter-colored accents at the edges. The most visually striking element is the rounded turret with a reddish dome-like top located slightly to the left of the roof's center, which contrasts with the darker main roof. Adjacent buildings have varying roof styles; the nearby structure to the right displays a flat roof, while others have rectangular or pitched designs with earthy tones. The surroundings include tree-lined streets with visible pedestrian pathways and a mix of open green patches and paved areas.",
            "around": "The central building, identifiable by its red brick walls and complex roof design, features a combination of pitched and flat roof shapes. The roof is primarily dark gray with small spires and other decorative elements close to the center, and the material appears to be slate or similar. To its **front-left**, there is a long rectangular building with a pitched roof covered in uniformly placed gray shingles. This building is characterized by its length and linear arrangement of regularly spaced dormer windows. To the **front-right**, a concrete structure with a flat roof and symmetrical, angular design dominates the view. The roof appears light gray, with some sections covered in greenery, likely indicative of a green roof design. Directly to the **back** of the central building is a taller, modern high-rise structure with a modular façade. It has a flat rooftop featuring metallic materials and white accents, along with well-delineated rectangular sections. Visible roads intersect near the central building, forming a mix of straight and slightly curved trajectories.Visible roads intersect near the central building, forming a mix of straight and slightly curved trajectories.  The asphalt has markings in white and occasionally green, indicating bike lanes. A small plaza is visible to the **right**, with a square shape and a combination of light gray stone paving and scattered benches. To the **front-right**, there is a medium-sized parking lot, its surface having faint striped markings to demarcate parking spaces. Vegetation is prevalent around the building cluster, with evenly distributed trees to the **front-left** and back-left**, and a patch of lawn adjacent to the central structure. No water bodies are present in the vicinity, and special objects such as fences and small sculptures can be seen scattered near the pathways. Minimal signage or symbols are visible, largely limited to road markings and lane indicators."
        }
    }
